package pos.beans;

import java.util.Scanner;

public class posSystem { //main() posSystem 꾸미기용 함수
	
	public void AuthTitle() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>> | <Hello> | 편의점 POS system [START ]  ]---------------------------");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(">>> [  *** Login을 시작합니다. ***] ");
		System.out.println("-----------------------------------------------------------------------");
	}
	
	public void posTitle() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>>  | <Select> |  [ 바로가기 기능 안내]        ");
		System.out.println(" 1: 재고관리 기능 | 2: 판매하기 기능 | 0번 : 프로그램 완전 종료 exit()");
		System.out.println("-----------------------------------------------------------------------");
	}	
	
	public void ManageTitle() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>>    [ ***  재고관리 기능 *** ]          ");
		System.out.println("-----------------------------------------------------------------------");
	}
	
	public void SellTitle() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>>    [ *** 판매하기 기능 *** ]          ");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>>     결제 방법 | 카드 : 1   현금 : 2    선택해주세요 ");
		System.out.println("-----------------------------------------------------------------------");
	}
	public void postBottom() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("------ >>> POS SYSTEM 종료 >> -------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
	}

}
