package pos.beans;

import java.util.Scanner;

public class posSystem { //main() posSystem 규격 데코용 클래스 객체
	
	public void AuthTitle() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>> | <Hello> | 편의점 POS system [START ]  ]---------------------------");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(">>> [  *** Login을 시작합니다. ***] ");
		System.out.println(">>> [ 1: 로그인 기능 | 2: 회원가입 기능 | 3: 회원정보 (ID/이름)으로 조회 기능 ");
		System.out.println("-----------------------------------------------------------------------");
	}
	
	public void posTitle() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>>  | <Select> |  [ 바로가기 기능 안내]        ");
		System.out.println(" 1: 재고관리 기능 | 2: 판매하기 기능 | 3: 날짜별 판매 통계 | 0: 강제 종료 exit()         ");
		System.out.println("-----------------------------------------------------------------------");
	}	
	
	public void ManageTitle() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>>>>>>>>>>>>[ ***  재고관리 기능 *** ]<<<<<<<<<<<<<<<<");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" 1: 물품 입고 처리 | 2: 재고 상품별 정보 조회 기능 | 3: 재고파일 보기 ");
		System.out.println("-----------------------------------------------------------------------");
	}
	
	public void SellTitle() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>>    [ *** 판매하기 기능 *** ]          ");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>>     결제 방법 | 카드 : 1   현금 : 2    선택해주세요 ");
		System.out.println("-----------------------------------------------------------------------");
	}
	
	public void MaxTitle() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println(" >>>    [ *** 날짜별 판매액 통계 기능 *** ]          ");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
	}
	
	
	public void postBottom() {
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("------ >>> POS SYSTEM 종료 >> -------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
		System.out.println("-----------------------------------------------------------------------");
	}

}
